; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared0 - mode
	thermograph2 - mode
	infrared4 - mode
	image3 - mode
	thermograph1 - mode
	spectrograph6 - mode
	thermograph5 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star8 - direction
	Star9 - direction
	GroundStation10 - direction
	Star11 - direction
	Star4 - direction
	Star5 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph5)
	(supports instrument0 spectrograph6)
	(supports instrument0 image3)
	(supports instrument0 infrared4)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(have_image Planet13 infrared0)
	(have_image Planet13 spectrograph6)
	(have_image Star14 image3)
	(have_image Phenomenon15 spectrograph6)
	(have_image Phenomenon15 infrared0)
	(have_image Phenomenon16 thermograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 phenomenon15 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 6
3. (turn_to satellite0 star5 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star5)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 phenomenon15 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 6
6. (take_image satellite0 phenomenon15 instrument0 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon15 instrument0 spectrograph6)
   added: (have_image phenomenon15 spectrograph6)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon16 instrument0 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 3 of 6
10. (turn_to satellite0 planet13 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet13)
   goals met: 3 of 6
11. (take_image satellite0 planet13 instrument0 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 4 of 6
12. (take_image satellite0 planet13 instrument0 spectrograph6)
   added: (have_image planet13 spectrograph6)
   goals met: 5 of 6
13. (turn_to satellite0 star14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star14)
   goals met: 5 of 6
14. (take_image satellite0 star14 instrument0 image3)
   added: (have_image star14 image3)
   goals met: 6 of 6
